# =============================================================================
# 個人NURリポジトリ
# =============================================================================
# VSCodeなど常に最新版を使いたいパッケージを提供
# =============================================================================
{ pkgs ? import <nixpkgs> { } }:

{
  # モジュールとライブラリ（必須）
  lib = import ./lib { inherit pkgs; };
  modules = import ./modules;
  overlays = import ./overlays;

  # パッケージ
  vscode = pkgs.callPackage ./pkgs/vscode { };
}
